Tekla Open API Reference for Tekla Structures 2025
GridPlane.DrawingVisibility Property
 The visibility of the grid surface in drawings.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool DrawingVisibility { get; set; }
Public Property DrawingVisibility As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
GridPlane Class
Tekla.Structures.Model Namespace